Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresSettings.SetOptions Method (ClashCheckOptions)
 Sets the clash check options.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool SetOptions(
	ClashCheckOptions Options
)
Public Shared Function SetOptions (
	Options As ClashCheckOptions
) As Boolean
Parameters
Options
Type: Tekla.Structures.ClashCheckOptions
The clash check options to be set.
Return Value
Type: Boolean
 True if the clash check options were successfully set.
See Also
Reference
TeklaStructuresSettings Class
SetOptions Overload
Tekla.Structures Namespace